app/views/clients/_form.html.erb

    <% form.number_field :policy_type %>
    <%= form.collection_select :policy_type, Service.order(:name),:id,:service_name, :prompt => "select one" %>  </div>
---
SELECT "services".* FROM "services" ORDER BY "name" ASC