app/views/clients/index.html.erb

        <td><%= client.address %></td>
        <td><%= Service.find(client.policy_type).service_name %></td>
---
SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]