app/controllers/clients_controller.rb

INSERT INTO "clients" ("first_name", "last_name", "address", "company", "email", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["address", ""], ["company", ""], ["email", ""], ["status", 1], ["created_at", "2022-06-05 15:32:01.827075"], ["updated_at", "2022-06-05 15:32:01.827075"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "status" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["status", 1], ["updated_at", "2022-06-05 08:14:00.976696"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)