app/controllers/services_controller.rb

  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("service_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["service_name", "HomeLoan"], ["created_at", "2022-06-06 10:17:16.829242"], ["updated_at", "2022-06-06 10:17:16.829242"]]