app/controllers/user_managements_controller.rb

SELECT "user_managements".* FROM "user_managements"
---
  def index
    @user_managements = UserManagement.all

INSERT INTO "user_managements" ("first_name", "last_name", "address", "policy_type", "company", "phone", "email", "policy_effective", "expiration_date", "premium", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user_management = UserManagement.new(user_management_params)

    respond_to do |format|
      if @user_management.save

SELECT "user_managements".* FROM "user_managements" WHERE "user_managements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user_management
      @user_management = UserManagement.find(params[:id])